"""15. Дано координати (x; y) точки і радіус кола (r). Визначити чи належить
дана точка колі, якщо його центр знаходиться на початку координат."""


def coordinates():
    print("введіть координати ")
    x = float(input("x = "))
    y = float(input("y = "))
    print("введіть радіус кола")
    r = float(input("r = "))
    if r**2 >= x**2 + y**2:
        return print("Дана точка належить колі")
    else:
        return print("Дана точка не належить колі")


coordinates()
